Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70N19B.PIC
      <edc:SFRDef edc:_addr="0x40038244" edc:access="------------w-ww-w-w----wwwwwwww" edc:cname="USBHS_DEVEPTIDR9" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPEC" edc:desc="Received SETUP Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTEC" edc:desc="NAKed OUT Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINEC" edc:desc="NAKed IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038248" edc:offset="0x1B8"/>
      <edc:SFRDef edc:_addr="0x40038400" edc:access="------------------nn-nnn--------" edc:cname="USBHS_HSTCTRL" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SOFE" edc:desc="Start of Frame Generation Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESET" edc:desc="Send USB Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESUME" edc:desc="Send USB Resume" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SPDCONF" edc:desc="Mode Configuration" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LOW_POWER" edc:desc="For a better consumption, if high speed is not needed." edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038404" edc:access="rrrrrrr-----rrrrrrrrrrrr-rrrrrrr" edc:cname="USBHS_HSTISR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNI" edc:desc="Device Connection Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCI" edc:desc="Device Disconnection Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTI" edc:desc="USB Reset Sent Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDI" edc:desc="Downstream Resume Sent Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMI" edc:desc="Upstream Resume Received Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFI" edc:desc="Host Start of Frame Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPI" edc:desc="Host Wake-Up Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Pipe 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Pipe 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Pipe 2 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Pipe 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Pipe 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Pipe 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Pipe 6 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Pipe 7 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Pipe 8 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Pipe 9 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_10" edc:desc="Pipe 10 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_11" edc:desc="Pipe 11 Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038408" edc:access="-------------------------wwwwwww" edc:cname="USBHS_HSTICR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNIC" edc:desc="Device Connection Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIC" edc:desc="Device Disconnection Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIC" edc:desc="USB Reset Sent Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIC" edc:desc="Downstream Resume Sent Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIC" edc:desc="Upstream Resume Received Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIC" edc:desc="Host Start of Frame Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIC" edc:desc="Host Wake-Up Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003840C" edc:access="wwwwwww------------------wwwwwww" edc:cname="USBHS_HSTIFR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNIS" edc:desc="Device Connection Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIS" edc:desc="Device Disconnection Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIS" edc:desc="USB Reset Sent Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIS" edc:desc="Downstream Resume Sent Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIS" edc:desc="Upstream Resume Received Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIS" edc:desc="Host Start of Frame Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIS" edc:desc="Host Wake-Up Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038410" edc:access="rrrrrrr-----rrrrrrrrrrrr-rrrrrrr" edc:cname="USBHS_HSTIMR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNIE" edc:desc="Device Connection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIE" edc:desc="Device Disconnection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIE" edc:desc="USB Reset Sent Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIE" edc:desc="Downstream Resume Sent Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIE" edc:desc="Upstream Resume Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIE" edc:desc="Host Start of Frame Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIE" edc:desc="Host Wake-Up Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Pipe 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Pipe 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Pipe 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Pipe 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Pipe 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Pipe 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Pipe 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Pipe 7 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Pipe 8 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Pipe 9 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_10" edc:desc="Pipe 10 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_11" edc:desc="Pipe 11 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038414" edc:access="wwwwwww-----wwwwwwwwwwww-wwwwwww" edc:cname="USBHS_HSTIDR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNIEC" edc:desc="Device Connection Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIEC" edc:desc="Device Disconnection Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIEC" edc:desc="USB Reset Sent Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIEC" edc:desc="Downstream Resume Sent Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIEC" edc:desc="Upstream Resume Received Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIEC" edc:desc="Host Start of Frame Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIEC" edc:desc="Host Wake-Up Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Pipe 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Pipe 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Pipe 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Pipe 3 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Pipe 4 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Pipe 5 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Pipe 6 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Pipe 7 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Pipe 8 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Pipe 9 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_10" edc:desc="Pipe 10 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_11" edc:desc="Pipe 11 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038418" edc:access="wwwwwww-----wwwwwwwwwwww-wwwwwww" edc:cname="USBHS_HSTIER" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCONNIES" edc:desc="Device Connection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIES" edc:desc="Device Disconnection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIES" edc:desc="USB Reset Sent Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIES" edc:desc="Downstream Resume Sent Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIES" edc:desc="Upstream Resume Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIES" edc:desc="Host Start of Frame Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIES" edc:desc="Host Wake-Up Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Pipe 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Pipe 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Pipe 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Pipe 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Pipe 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Pipe 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Pipe 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Pipe 7 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Pipe 8 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Pipe 9 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_10" edc:desc="Pipe 10 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_11" edc:desc="Pipe 11 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003841C" edc:access="-------nnnnnnnnn-------nnnnnnnnn" edc:cname="USBHS_HSTPIP" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PEN0" edc:desc="Pipe 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN1" edc:desc="Pipe 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN2" edc:desc="Pipe 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN3" edc:desc="Pipe 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN4" edc:desc="Pipe 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN5" edc:desc="Pipe 5 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN6" edc:desc="Pipe 6 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN7" edc:desc="Pipe 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN8" edc:desc="Pipe 8 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PRST0" edc:desc="Pipe 0 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST1" edc:desc="Pipe 1 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST2" edc:desc="Pipe 2 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST3" edc:desc="Pipe 3 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST4" edc:desc="Pipe 4 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST5" edc:desc="Pipe 5 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST6" edc:desc="Pipe 6 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST7" edc:desc="Pipe 7 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST8" edc:desc="Pipe 8 Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038420" edc:access="--------nnnnnnnn--nnnnnnnnnnnnnn" edc:cname="USBHS_HSTFNUM" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MFNUM" edc:desc="Micro Frame Number" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FNUM" edc:desc="Frame Number" edc:nzwidth="0xB"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLENHIGH" edc:desc="Frame Length" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038424" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="USBHS_HSTADDR1" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HSTADDRP0" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP1" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP2" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSTADDRP3" edc:desc="USB Host Address" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
